[command]/home/runner/work/_temp/b1ddaca8-8941-4f03-b9a2-91df370073ce/terraform-bin -chdir=terraform_backend plan -out=tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_dynamodb_table.tf_locks[0m will be created
[0m  [32m+[0m[0m resource "aws_dynamodb_table" "tf_locks" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m billing_mode     = "PAY_PER_REQUEST"
      [32m+[0m[0m hash_key         = "LockID"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "tf-state-locks"
      [32m+[0m[0m read_capacity    = (known after apply)
      [32m+[0m[0m region           = "us-east-1"
      [32m+[0m[0m stream_arn       = (known after apply)
      [32m+[0m[0m stream_label     = (known after apply)
      [32m+[0m[0m stream_view_type = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Name" = "Terraform State Lock Table"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Name" = "Terraform State Lock Table"
        }
      [32m+[0m[0m write_capacity   = (known after apply)

      [32m+[0m[0m attribute {
          [32m+[0m[0m name = "LockID"
          [32m+[0m[0m type = "S"
        }
    }

[1m  # aws_s3_bucket.tf_state[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket" "tf_state" {
      [32m+[0m[0m acceleration_status         = (known after apply)
      [32m+[0m[0m acl                         = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m bucket                      = "tf-state-dency"
      [32m+[0m[0m bucket_domain_name          = (known after apply)
      [32m+[0m[0m bucket_prefix               = (known after apply)
      [32m+[0m[0m bucket_region               = (known after apply)
      [32m+[0m[0m bucket_regional_domain_name = (known after apply)
      [32m+[0m[0m force_destroy               = true
      [32m+[0m[0m hosted_zone_id              = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m object_lock_enabled         = (known after apply)
      [32m+[0m[0m policy                      = (known after apply)
      [32m+[0m[0m region                      = "us-east-1"
      [32m+[0m[0m request_payer               = (known after apply)
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Name" = "Terraform State Bucket"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Name" = "Terraform State Bucket"
        }
      [32m+[0m[0m website_domain              = (known after apply)
      [32m+[0m[0m website_endpoint            = (known after apply)
    }

[1m  # aws_s3_bucket_server_side_encryption_configuration.tf_state_encryption[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_server_side_encryption_configuration" "tf_state_encryption" {
      [32m+[0m[0m bucket = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m region = "us-east-1"

      [32m+[0m[0m rule {
          [32m+[0m[0m apply_server_side_encryption_by_default {
              [32m+[0m[0m sse_algorithm = "AES256"
            }
        }
    }

[1m  # aws_s3_bucket_versioning.tf_state_versioning[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_versioning" "tf_state_versioning" {
      [32m+[0m[0m bucket = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m region = "us-east-1"

      [32m+[0m[0m versioning_configuration {
          [32m+[0m[0m mfa_delete = (known after apply)
          [32m+[0m[0m status     = "Enabled"
        }
    }

[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create[0m%0A%0ATerraform will perform the following actions:%0A%0A[1m  # aws_dynamodb_table.tf_locks[0m will be created%0A[0m  [32m+[0m[0m resource "aws_dynamodb_table" "tf_locks" {%0A      [32m+[0m[0m arn              = (known after apply)%0A      [32m+[0m[0m billing_mode     = "PAY_PER_REQUEST"%0A      [32m+[0m[0m hash_key         = "LockID"%0A      [32m+[0m[0m id               = (known after apply)%0A      [32m+[0m[0m name             = "tf-state-locks"%0A      [32m+[0m[0m read_capacity    = (known after apply)%0A      [32m+[0m[0m region           = "us-east-1"%0A      [32m+[0m[0m stream_arn       = (known after apply)%0A      [32m+[0m[0m stream_label     = (known after apply)%0A      [32m+[0m[0m stream_view_type = (known after apply)%0A      [32m+[0m[0m tags             = {%0A          [32m+[0m[0m "Name" = "Terraform State Lock Table"%0A        }%0A      [32m+[0m[0m tags_all         = {%0A          [32m+[0m[0m "Name" = "Terraform State Lock Table"%0A        }%0A      [32m+[0m[0m write_capacity   = (known after apply)%0A%0A      [32m+[0m[0m attribute {%0A          [32m+[0m[0m name = "LockID"%0A          [32m+[0m[0m type = "S"%0A        }%0A    }%0A%0A[1m  # aws_s3_bucket.tf_state[0m will be created%0A[0m  [32m+[0m[0m resource "aws_s3_bucket" "tf_state" {%0A      [32m+[0m[0m acceleration_status         = (known after apply)%0A      [32m+[0m[0m acl                         = (known after apply)%0A      [32m+[0m[0m arn                         = (known after apply)%0A      [32m+[0m[0m bucket                      = "tf-state-dency"%0A      [32m+[0m[0m bucket_domain_name          = (known after apply)%0A      [32m+[0m[0m bucket_prefix               = (known after apply)%0A      [32m+[0m[0m bucket_region               = (known after apply)%0A      [32m+[0m[0m bucket_regional_domain_name = (known after apply)%0A      [32m+[0m[0m force_destroy               = true%0A      [32m+[0m[0m hosted_zone_id              = (known after apply)%0A      [32m+[0m[0m id                          = (known after apply)%0A      [32m+[0m[0m object_lock_enabled         = (known after apply)%0A      [32m+[0m[0m policy                      = (known after apply)%0A      [32m+[0m[0m region                      = "us-east-1"%0A      [32m+[0m[0m request_payer               = (known after apply)%0A      [32m+[0m[0m tags                        = {%0A          [32m+[0m[0m "Name" = "Terraform State Bucket"%0A        }%0A      [32m+[0m[0m tags_all                    = {%0A          [32m+[0m[0m "Name" = "Terraform State Bucket"%0A        }%0A      [32m+[0m[0m website_domain              = (known after apply)%0A      [32m+[0m[0m website_endpoint            = (known after apply)%0A    }%0A%0A[1m  # aws_s3_bucket_server_side_encryption_configuration.tf_state_encryption[0m will be created%0A[0m  [32m+[0m[0m resource "aws_s3_bucket_server_side_encryption_configuration" "tf_state_encryption" {%0A      [32m+[0m[0m bucket = (known after apply)%0A      [32m+[0m[0m id     = (known after apply)%0A      [32m+[0m[0m region = "us-east-1"%0A%0A      [32m+[0m[0m rule {%0A          [32m+[0m[0m apply_server_side_encryption_by_default {%0A              [32m+[0m[0m sse_algorithm = "AES256"%0A            }%0A        }%0A    }%0A%0A[1m  # aws_s3_bucket_versioning.tf_state_versioning[0m will be created%0A[0m  [32m+[0m[0m resource "aws_s3_bucket_versioning" "tf_state_versioning" {%0A      [32m+[0m[0m bucket = (known after apply)%0A      [32m+[0m[0m id     = (known after apply)%0A      [32m+[0m[0m region = "us-east-1"%0A%0A      [32m+[0m[0m versioning_configuration {%0A          [32m+[0m[0m mfa_delete = (known after apply)%0A          [32m+[0m[0m status     = "Enabled"%0A        }%0A    }%0A%0A[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.%0A[0m[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0

<!-- Sticky Pull Request Comment🧱 Terraform Backend Plan Output -->